from aiogram.types import ReplyKeyboardMarkup, KeyboardButton, ReplyKeyboardRemove

#нормальний
API_TOKEN = "5403738951:AAEbbME_mAhs9sVAQxvy9KYGG5MjktTfaW8"

#тестовий
#API_TOKEN = "5718594262:AAFrlaZpViF_e2AVCiqQjbh7JqZ9JEzVKR4"


# webhook settings
WEBHOOK_HOST = "https://aiogramnubipbot.herokuapp.com"
WEBHOOK_PATH = f"/{API_TOKEN}"
WEBHOOK_URL = f"{WEBHOOK_HOST}{WEBHOOK_PATH}"


# webserver settings
WEBAPP_HOST = "0.0.0.0"
WEBAPP_PORT = 3001



DEPARTMENTS = [
    "Економічне відділення", "Маркетинг і товарознавство", "Комп'ютерна інженерія", 
]

WEEKDAYS = [
    "Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця", "Субота"
]

SKIP_TR = [
    0, 2, 3, 4, 33, 34
]

ADMINS = [
    706030949,
]



SUBJECTS = [
    "Людина",
    "Захист України д.",
    "Математика",
    "Історія: Україна і світ",
    "Мистецтво",
    "Зарубіжна література",
    "Фізична культура",
    "Земля",
    "Українська література",
    "Безпека життєдіяльності та охорона праці",
    "Основи охорони праці",
    "Екологія",
    "Соціологія",
    "Бухгалтерський облік",
    "Іноземна мова (англ.)",
    "Фінанси",
    "Планування та організація діяльності підприємства",
    "Організація власного бізнесу",
    "Економічний аналіз",
    "Інформаційні системи і технології в обліку",
    "Облік і звітність у бюджетних установах",
    "Менеджмент",
    "Українська мова",
    "Банківські операції",
    "Податкова система",
    "Товарознавство",
    "Основи психології",
    "Організація і технологія торговельних процесів",
    "Економічна теорія",
    "Організація виробництва в закладах ресторанного господарства",
    "Мікробіологія та фізіологія харчування",
    "Технологія виробництва кулінарної продукції",
    "Фізичне виховання",
    "Логістика",
    "Комунікаційна діяльність",
    "Маркетинг соціальних мереж	",
    "Інформаційні системи і технології у маркетингу",
    "Основи менеджменту",
    "Основи маркетингу і реклама",
    "Алгоритми та методи обчислень",
    "Основи патентознавства",
    "БЖД",
    "Економіка і планування виробництва",
    "Електрорадіовимірювання",
    "Інженерна та комп'ютерна графіка",
    "Програмування",
    "Чинники успішного працевлаштування за фахом",
    "Системне програмування",
    "Основи веб-дизайну",
    "Захист України хл.",
    "Біорізноманіття",
    "Основи філософських знань",
    "Технологія галузі",
    "Гроші та кредит",
    "Фінансовий облік",
    "Ціноутворення",
    "Теоретичні основи товарознавства",
    "Основи екології та безпеки товарів нар. споживання",
    "Процеси та апарати харчових виробництв",
    "Аналітична хімія",
    "Устаткування закладів ресторанного господарства",
    "Управління закупівлями та продажами",
    "Товарознавство непродовольчих товарів",
    "Технології",
    "Основи метрологічної діяльності",
    "Комп'ютерна логіка",
    "Комп'ютерна електроніка",
    "Об'єктно-орієнтовне програмування",
    "Облік у банках",
    "Виховна година",
    "Культурологія",
    "Фінанси підприємства",
    "ІСіТ на підприємстві",
    "ІСіТ в обліку",
    "Фінансовий ринок",
    "Громадянська освіта",
    "Регіональна економіка",
    "Економіка підприємств різних типів",
    "Сучасна українська кухня",
    "Особливості кухні народів світу",
    "Торговельна реклама",
    "Всесвіт",
    "Страхові послуги",
    "Психологія та етика ділових відносин",
    "Організація обслуговування і сервіс в закладах ресторанного господарства",
    "Ринкові дослідження",
    "Комерційна діяльність",
    "Архітектура комп'ютерів",
    "Операційні системи",
    "Надійність, діагностика та експлуатація комп'ютерних систем і мереж",
    "Бюджетна система",
    "Інформатика",
    "Комп'ютерні системи і мережі",
    "Правознавство",
    "Вища математика",
    "Українська мова (за проф. спрям.)",
    "Іноземна мова (за проф. спрям.)",
    "Управління витратами",
    "ІСіТ",
    "Психологія",
]

# ІСіТ, ІСіТ на підприємстві, ІСіТ в обліку
# Фізичне виховання, Фізична культура

s = dict()
for iter, les in enumerate(SUBJECTS):
    s[f"{iter}"] = les

SUBJECTS = s
del s

SUBJECTS = dict(sorted(SUBJECTS.items(), key=lambda x: x[1], reverse=False))


EQUAL_SUBJECTS = {
    "Теоретичні основи товарознавства": [
        "Товарознавство (теор. основи)",
    ],

    "Товарознавство непродовольчих товарів": [
        "Товарознавство непрод. товарів",
    ],

    "Фізична культура": [
        "Фізкультура",
    ],

    "Інженерна та комп'ютерна графіка": [
        "Інженерна і комп'ютерна графіка",
    ],

    "Захист України д.": [
        "Захист Україна дівч.",
    ]
}


FSM_ikm = ReplyKeyboardMarkup(resize_keyboard=True).add(KeyboardButton("📢 Створити оголошення"))

